#   7. Реализовать проект «Операции с комплексными числами». Создайте класс «Комплексное число». Реализуйте перегрузку
#   методов сложения и умножения комплексных чисел. Проверьте работу проекта. Для этого создаёте экземпляры класса
#   (комплексные числа), выполните сложение и умножение созданных экземпляров. Проверьте корректность полученного
#   результата.

class Complex:
    def __init__(sel, a, b, *args):
        sel.a = a
        sel.b = b
        sel.z = 'a + b * i'

    def __add__(sel, int):
        print(f'Сумма z1 и z2 равна:')
        return f'z = {sel.a + int.a} + {sel.b + int.b} * i'

    def __mul__(sel, int):
        print(f'Произведение z1 и z2 равно:')
        return f'z = {sel.a * int.a - (sel.b * int.b)} + {sel.b * int.a} * i'

    def __str__(sel):
        return f'z = {sel.a} + {sel.b} * i'


z_1 = Complex(1, 7)
z_2 = Complex(2, 6)

print(z_1)
print(z_1 + z_2)
print(z_1 * z_2)